Revit 2027 API
IFCExportOptions.WallAndColumnSplitting Property
 Option to allow division of multi-level walls and columns by levels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool WallAndColumnSplitting { get; set; }
Public Property WallAndColumnSplitting As Boolean
	Get
	Set
public:
property bool WallAndColumnSplitting {
	bool get ();
	void set (bool value);
}
member WallAndColumnSplitting : bool with get, set
Property Value
Boolean
Remarks
 This option will always be considered true when FileVersion is IFC-BCA. For other File Versions, default is false.
See Also
Reference
IFCExportOptions Class
Autodesk.Revit.DB Namespace